# **Practice 5 - Data Cleaning and Preparation**

## Handling missing data
For numeric data, pandas uses value NaN. It is called a Sentinel value and can be easily detected.

In [31]:
import pandas as pd
import numpy as np

string_data = pd.Series(['a','b',np.nan,'d'])
string_data

0      a
1      b
2    NaN
3      d
dtype: object

In [32]:
print(string_data.isnull())
print(f'\nNaN values: {sum(string_data.isnull())}')

0    False
1    False
2     True
3    False
dtype: bool

NaN values: 1

In [33]:
# Creating datafram from Series
s1 = pd.Series([10, 20, 30], name="Apples")
s2 = pd.Series([1.5, 2.7, 3.6, 4.2, 5.9], name="Inches")
s3 = pd.Series(["red", "blue", "green", "yellow", "orange", "purple"], name="Colors")
df_a = pd.DataFrame([s1,s2]).T
df_a = df_a.reindex(range(len(s3)))
print(df_a)
df_a[s3.name] = s3
df_a

   Apples  Inches
0    10.0     1.5
1    20.0     2.7
2    30.0     3.6
3     NaN     4.2
4     NaN     5.9
5     NaN     NaN

   Apples  Inches  Colors
0    10.0     1.5     red
1    20.0     2.7    blue
2    30.0     3.6   green
3     NaN     4.2  yellow
4     NaN     5.9  orange
5     NaN     NaN  purple

## Displaying dataframes in Jupyter Notebook

* Typing just `df_a` (as the last line of a cell) triggers Jupyterâ€™s rich display system, which renders DataFrames as nice HTML tables.
* Using `print(df_a)` instead calls the plain text representation, which is less formatted.
* Using `display()` gives you the same rich HTML table as typing `df_a` by itself

In [ ]:
from IPython.display import display
display(df_a)
s4 = pd.Series(
    ["Bondi", "Copacabana", "Waikiki", "Malibu", 
    "Santorini", "Maui", "Ipanema", "Cancun"],
    name="Beaches")
df_a = df_a.reindex(range(len(s4)))
df_a[s4.name] = s4
display(df_a)

   Apples  Inches  Colors
0    10.0     1.5     red
1    20.0     2.7    blue
2    30.0     3.6   green
3     NaN     4.2  yellow
4     NaN     5.9  orange
5     NaN     NaN  purple

   Apples  Inches  Colors     Beaches
0    10.0     1.5     red       Bondi
1    20.0     2.7    blue  Copacabana
2    30.0     3.6   green     Waikiki
3     NaN     4.2  yellow      Malibu
4     NaN     5.9  orange   Santorini
5     NaN     NaN  purple        Maui
6     NaN     NaN     NaN     Ipanema
7     NaN     NaN     NaN      Cancun

: